0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
static inline __attribute__((always_inline)) void rvswd_clock_low(void) {
    GPIOA->BSHR = RVSWD_CLOCK_PIN << 16u;
}

static inline __attribute__((always_inline)) void rvswd_clock_high(void) {
    GPIOA->BSHR = RVSWD_CLOCK_PIN;
}

static inline __attribute__((always_inline)) void rvswd_data_low(void) {
    GPIOA->BSHR = RVSWD_DATA_PIN << 16u;
}

static inline __attribute__((always_inline)) void rvswd_data_high(void) {
    GPIOA->BSHR = RVSWD_DATA_PIN;
}

static inline __attribute__((always_inline)) void rvswd_fast_half_period(void) {
    __asm volatile(
        "nop\n"
        "nop\n");
}

static inline __attribute__((always_inline)) void rvswd_drive_bit_fast(
    uint8_t value) {
    GPIOA->BSHR = (RVSWD_CLOCK_PIN << 16u) |
                  (value != 0u ? RVSWD_DATA_PIN
                               : (RVSWD_DATA_PIN << 16u));
    rvswd_fast_half_period();
    GPIOA->BSHR = RVSWD_CLOCK_PIN;
    rvswd_fast_half_period();
}

static inline __attribute__((always_inline)) uint8_t rvswd_sample_bit_fast(void) {
    uint8_t value;

    GPIOA->BSHR = RVSWD_CLOCK_PIN << 16u;
    rvswd_fast_half_period();
    GPIOA->BSHR = RVSWD_CLOCK_PIN;
    value = (GPIOA->INDR & RVSWD_DATA_PIN) != 0u ? 1u : 0u;
    rvswd_fast_half_period();
    return value;
}

static void rvswd_config_data_input(void) {
    // turnaround 开始前将锁存置高，释放 PA3 SWDIO，PA1 通过外部电阻提供上拉
    GPIOA->BSHR = RVSWD_DATA_PIN;
    GPIOA->CFGLR = (GPIOA->CFGLR & ~(0xfu << RVSWD_DATA_CFG_SHIFT)) |
                   (0x08u << RVSWD_DATA_CFG_SHIFT);
}

static void rvswd_start(void) {
    rvswd_config_data_output();
    rvswd_clock_high();
    rvswd_data_high();
    rvswd_half_period();
    rvswd_data_low();
    rvswd_half_period();
}

static void rvswd_stop(void) {
    // 采样结束时 SWCLK 仍为高，先接管数据线，再结束当前位
    rvswd_config_data_output();
    rvswd_clock_low();
    rvswd_data_low();
    rvswd_half_period();
    rvswd_clock_high();
    rvswd_half_period();
    rvswd_data_high();
    rvswd_half_period();
}

static inline __attribute__((always_inline)) void rvswd_drive_bit(uint8_t value) {
    // 先拉低时钟，再更新数据，给 V30X 保留完整的数据建立窗口
    rvswd_clock_low();
    if (value != 0u) {
        rvswd_data_high();
    } else {
        rvswd_data_low();
    }
    rvswd_half_period();
    rvswd_clock_high();
    rvswd_half_period();
}

static inline __attribute__((always_inline)) uint8_t rvswd_sample_bit(void) {
    uint8_t value;

    rvswd_clock_low();
    rvswd_half_period();
    rvswd_clock_high();
    // 上升沿后立即读取目标驱动的 SWDIO 电平
    value = (GPIOA->INDR & RVSWD_DATA_PIN) != 0u ? 1u : 0u;
    rvswd_half_period();
    return value;
}

static void rvswd_drive_range(const uint8_t *frame, uint8_t first_bit, uint8_t bit_count) {
    if (rvswd_fast_timing) {
        const uint8_t *byte = &frame[first_bit >> 3u];
        uint8_t mask = (uint8_t)(0x80u >> (first_bit & 7u));

        // 快时序路径按字节推进，保持固定采样窗口并减少 bit 定位开销
        for (uint8_t bit = 0u; bit < bit_count; ++bit) {
            rvswd_drive_bit_fast((*byte & mask) != 0u ? 1u : 0u);
            mask >>= 1u;
            if (mask == 0u) {
                mask = 0x80u;
                ++byte;
            }
        }
        return;
    }
    for (uint8_t bit = 0u; bit < bit_count; ++bit) {
        rvswd_drive_bit(rvswd_frame_get_bit(frame, (uint8_t)(first_bit + bit)));
    }
}

static void rvswd_sample_range(uint8_t *frame, uint8_t first_bit, uint8_t bit_count) {
    if (rvswd_fast_timing) {
        uint8_t *byte = &frame[first_bit >> 3u];
        uint8_t mask = (uint8_t)(0x80u >> (first_bit & 7u));

        // 快时序路径复用字节 mask 写回采样结果，保持目标建立时间
        for (uint8_t bit = 0u; bit < bit_count; ++bit) {
            if (rvswd_sample_bit_fast() != 0u) {
                *byte |= mask;
            } else {
                *byte &= (uint8_t)~mask;
            }
            mask >>= 1u;
            if (mask == 0u) {
                mask = 0x80u;
                ++byte;
            }
        }
        return;
    }
    for (uint8_t bit = 0u; bit < bit_count; ++bit) {
        rvswd_frame_set_bit(frame, (uint8_t)(first_bit + bit), rvswd_sample_bit());
    }
}

static void rvswd_drive_value(uint32_t value, uint8_t bit_count) {
    for (uint8_t bit = bit_count; bit > 0u; --bit) {
        rvswd_drive_bit((uint8_t)((value >> (bit - 1u)) & 1u));
    }
}

static uint32_t rvswd_sample_value(uint8_t bit_count) {
    uint32_t value = 0u;

    for (uint8_t bit = 0u; bit < bit_count; ++bit) {
        value = (value << 1u) | rvswd_sample_bit();
    }
    return value;
}

static void rvswd_wakeup(bool stop_condition) {
    __disable_irq();
    rvswd_config_data_output();
    rvswd_clock_high();
    rvswd_data_high();
    for (uint8_t clock = 0u; clock < RVSWD_WAKEUP_CLOCKS; ++clock) {
        rvswd_clock_low();
        rvswd_half_period();
        rvswd_clock_high();
        rvswd_half_period();
    }
    if (stop_condition) {
        rvswd_stop();
    }
    __enable_irq();
    bsp_delay_us(RVSWD_INTERFRAME_GUARD_US);
}

static bool rvswd_transaction_long(uint8_t operation, uint8_t address, uint32_t value,
                                    uint8_t host_parity,
                                    uint8_t *target_address_result,
                                    uint32_t *result, uint8_t *status) {
    uint32_t target_address;
    uint32_t target_data;
    uint32_t target_status;
    uint32_t target_parity;
    __disable_irq();
    rvswd_start();
    rvswd_drive_value(address & 0x7fu, 7u);
    rvswd_drive_value(value, 32u);
    rvswd_drive_value(operation, 2u);
    rvswd_drive_value(host_parity, 1u);

    rvswd_config_data_input();
    target_address = rvswd_sample_value(7u);
    target_data = rvswd_sample_value(32u);
    target_status = rvswd_sample_value(2u);
    target_parity = rvswd_sample_value(1u);
    rvswd_config_data_output();
    rvswd_stop();
    __enable_irq();
    bsp_delay_us(RVSWD_INTERFRAME_GUARD_US);

    // 官方 CH582 抓包中目标末位是方向占位，读为 1、写为 0，不作为校验拒绝条件
    (void)target_parity;
    if (target_address_result != NULL) {
        *target_address_result = (uint8_t)target_address;
    }
    if (result != NULL) {
        *result = target_data;
    }
    if (status != NULL) {
        *status = (uint8_t)target_status;
    }
    return true;
}

static bool rvswd_transaction(const uint8_t *host, uint8_t *target, bool read) {
    __disable_irq();
    rvswd_start();

    // 头部校验后切换一次方向，保留目标确认窗口
    rvswd_drive_range(host, 0u, 9u);
    rvswd_config_data_input();
    rvswd_sample_range(target, 9u, 3u);
    rvswd_config_data_output();
    rvswd_drive_range(host, 12u, 2u);

    if (read) {
        // 读操作由目标返回数据、校验和状态，主机发送两个收尾位
        rvswd_config_data_input();
        rvswd_sample_range(target, 14u, 36u);
        rvswd_config_data_output();
        rvswd_drive_range(host, 50u, 2u);
    } else {
        // 写操作由主机发送数据和校验，目标返回三位状态
        rvswd_drive_range(host, 14u, 33u);
        rvswd_config_data_input();
        rvswd_sample_range(target, 47u, 3u);
        rvswd_config_data_output();
        rvswd_drive_range(host, 50u, 2u);
    }

    rvswd_stop();
    __enable_irq();

    // 目标在 STOP 后完成 DMI 状态更新，下一帧从空闲高电平开始
    bsp_delay_us(RVSWD_INTERFRAME_GUARD_US);

