0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
    return true;
}

void rvswd_gpio_init(void) {
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOA;
    // PA1 通过 5.1 kOhm 外部电阻给 PA3 SWDIO 提供上拉，首帧前保持高电平
    GPIOA->BSHR = RVSWD_DATA_PULLUP_PIN | RVSWD_CLOCK_PIN | RVSWD_DATA_PIN;
    GPIOA->CFGLR = (GPIOA->CFGLR & ~((0xfu << RVSWD_DATA_CFG_SHIFT) |
                                     (0xfu << RVSWD_CLOCK_CFG_SHIFT) |
                                     (0xfu << RVSWD_DATA_PULLUP_CFG_SHIFT))) |
                   (0x08u << RVSWD_DATA_CFG_SHIFT) |
                   (RVSWD_CLOCK_MODE_OUTPUT_50MHZ << RVSWD_CLOCK_CFG_SHIFT) |
                   (0x01u << RVSWD_DATA_PULLUP_CFG_SHIFT);
}

void rvswd_gpio_disconnect(void) {
    GPIOA->BSHR = RVSWD_PINS;
    // 会话结束后释放 PA1 上拉控制和两根调试线，目标断电时禁止经 IO 反向供电
    GPIOA->CFGLR = (GPIOA->CFGLR & ~((0xfu << RVSWD_DATA_CFG_SHIFT) |
                                     (0xfu << RVSWD_CLOCK_CFG_SHIFT) |
                                     (0xfu << RVSWD_DATA_PULLUP_CFG_SHIFT))) |
                   (0x04u << RVSWD_DATA_CFG_SHIFT) |
                   (0x04u << RVSWD_CLOCK_CFG_SHIFT) |
                   (0x04u << RVSWD_DATA_PULLUP_CFG_SHIFT);
}

static bool rvswd_gpio_restore_debug_module(void) {
    bool success = true;

    // QingKe 调试模块启动和异常恢复时会丢失关键写入，重复配置确保命令生效
    success = rvswd_gpio_write_dmi(RVSWD_DMI_SHADOW, RVSWD_DEBUG_UNLOCK) && success;
    success = rvswd_gpio_write_dmi(RVSWD_DMI_CONFIG, RVSWD_DEBUG_UNLOCK) && success;
    success = rvswd_gpio_write_dmi(RVSWD_DMI_SHADOW, RVSWD_DEBUG_UNLOCK) && success;
    success = rvswd_gpio_write_dmi(RVSWD_DMI_CONFIG, RVSWD_DEBUG_UNLOCK) && success;
    success = rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x80000001u) && success;
    success = rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x80000001u) && success;
    success = rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x80000001u) && success;
    return success;
}

bool rvswd_gpio_write_dmi(uint8_t address, uint32_t value) {
    if (rvswd_packet_mode == RVSWD_PACKET_LONG) {
        uint8_t status;

        rvswd_dmi_failure_retryable = false;
        for (uint8_t retry = 0u; retry < RVSWD_DMI_WRITE_RETRY_COUNT; ++retry) {
            if (!rvswd_transaction_long(2u, address, value, 0u, NULL, NULL, &status)) {
                rvswd_dmi_failure_retryable = true;
                bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
                continue;
            }

            rvswd_dmi_last_status = status;
            if (status == RVSWD_LONG_STATUS_OK) {
                if (address == 0x17u) {
                    // COMMAND 写入完成后留出执行窗口，避免下一次 DMI 访问撞上 abstract busy
                    bsp_delay_us(RVSWD_ABSTRACT_COMMAND_DELAY_US);
                }
                return true;
            }
            if (status == RVSWD_LONG_STATUS_BUSY) {
                rvswd_dmi_failure_retryable = true;
                bsp_delay_us(RVSWD_DMI_BUSY_DELAY_US);
            } else {
                rvswd_dmi_failure_retryable = false;
                bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
            }
        }
        return false;
    }

    uint8_t frame[7] = {0};
    uint8_t target[7] = {0};
    uint8_t status;

    rvswd_frame_pack_write(frame, address, value);
    rvswd_dmi_failure_retryable = false;
    for (uint8_t retry = 0u; retry < RVSWD_DMI_WRITE_RETRY_COUNT; ++retry) {
        if (!rvswd_transaction(frame, target, false)) {
            return false;
        }

        status = rvswd_frame_unpack_handshake(target);
        rvswd_dmi_last_status = status;
        if (rvswd_frame_status_is_ok(status)) {
            if (address == 0x17u) {
                // COMMAND 写入完成后留出执行窗口，避免下一次 DMI 访问撞上 abstract busy
                bsp_delay_us(RVSWD_ABSTRACT_COMMAND_DELAY_US);
            }
            return true;
        }
        if (status == RVSWD_STATUS_BUSY) {
            rvswd_dmi_failure_retryable = true;
            bsp_delay_us(RVSWD_DMI_BUSY_DELAY_US);
        } else {
            rvswd_dmi_failure_retryable = false;
            // 非成功状态允许短暂重试，避免单次线噪声中断连续内存传输
            bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
        }
    }

    return false;
}

static bool rvswd_gpio_read_memory32_synchronized(uint32_t address, uint32_t *value) {
    uint32_t abstractcs;
    uint32_t data;

    // 使用 x8 执行 c.lw，避免连续内存访问时的寄存器别名问题
    rvswd_memory_last_error = 0u;
    if (!rvswd_gpio_write_dmi(0x16u, 0x00000700u)) {
        rvswd_memory_last_error = 0x81u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(0x20u, 0x90024000u)) {
        rvswd_memory_last_error = 0x82u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(0x04u, address)) {
        rvswd_memory_last_error = 0x83u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(0x17u, 0x00271008u)) {
        rvswd_memory_last_error = 0x84u;
        return false;
    }
    if (!rvswd_gpio_wait_abstract_idle(&abstractcs)) {
        rvswd_memory_last_error = 0x85u;
        return false;
    }
    if (((abstractcs >> 8u) & 0x07u) != 0u) {
        rvswd_memory_last_error = 0x90u | (uint8_t)((abstractcs >> 8u) & 0x07u);
        return false;
    }
    if (!rvswd_gpio_write_dmi(0x17u, 0x00221008u)) {
        rvswd_memory_last_error = 0x86u;
        return false;
    }
    if (!rvswd_gpio_wait_abstract_idle(&abstractcs)) {
        rvswd_memory_last_error = 0x87u;
        return false;
    }
    if (((abstractcs >> 8u) & 0x07u) != 0u) {
        rvswd_memory_last_error = 0xa0u | (uint8_t)((abstractcs >> 8u) & 0x07u);
        return false;
    }
    if (!rvswd_gpio_read_dmi(0x04u, &data)) {
        rvswd_memory_last_error = 0x88u;
        return false;
    }

    *value = data;
    return true;
}

static bool rvswd_gpio_read_memory8_ch5xx(uint32_t address, uint8_t *value) {
    uint32_t abstractcs;
    uint32_t data;

    // LinkE 通过 data0 传入地址，Program Buffer 将目标字节写回 data1
    if (value == NULL ||
        !rvswd_gpio_write_raw_gpr(13u, RVSWD_CH5XX_DEBUG_DATA_ADDRESS) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x20u, 0x00058483u) ||
        !rvswd_gpio_write_dmi(0x21u, 0x00968223u) ||
        !rvswd_gpio_write_dmi(0x22u, 0x00100073u) ||
        !rvswd_gpio_write_dmi(0x04u, address) ||
        !rvswd_gpio_write_dmi(0x17u, 0x0027100bu) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_gpio_read_dmi(0x05u, &data)) {
        return false;
    }

    *value = (uint8_t)data;
    return true;
}

