0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
enum rvswd_ch5xx_byte_access_mode {
    RVSWD_CH5XX_BYTE_ACCESS_NONE,
    RVSWD_CH5XX_BYTE_ACCESS_READ,
    RVSWD_CH5XX_BYTE_ACCESS_WRITE,
};

struct rvswd_ch5xx_byte_access {
    enum rvswd_ch5xx_byte_access_mode mode;
};

static bool rvswd_gpio_ch5xx_prepare_byte_access(
    struct rvswd_ch5xx_byte_access *access,
    enum rvswd_ch5xx_byte_access_mode mode) {
    uint32_t load_instruction;
    uint32_t store_instruction;

    if (access->mode == mode) {
        return true;
    }

    if (mode == RVSWD_CH5XX_BYTE_ACCESS_READ) {
        load_instruction = 0x00058483u;
        store_instruction = 0x00968223u;
    } else if (mode == RVSWD_CH5XX_BYTE_ACCESS_WRITE) {
        load_instruction = 0x00468483u;
        store_instruction = 0x00958023u;
    } else {
        return false;
    }

    // 全擦期间连续访问 Flash 命令口，切换读写方向时才重建 Program Buffer
    if (!rvswd_gpio_write_raw_gpr(13u, RVSWD_CH5XX_DEBUG_DATA_ADDRESS) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x20u, load_instruction) ||
        !rvswd_gpio_write_dmi(0x21u, store_instruction) ||
        !rvswd_gpio_write_dmi(0x22u, 0x00100073u)) {
        access->mode = RVSWD_CH5XX_BYTE_ACCESS_NONE;
        return false;
    }

    access->mode = mode;
    return true;
}

static bool rvswd_gpio_ch5xx_erase_write8(struct rvswd_ch5xx_byte_access *access,
                                          uint32_t address, uint8_t value) {
    uint32_t abstractcs;

    if (!rvswd_gpio_ch5xx_prepare_byte_access(access, RVSWD_CH5XX_BYTE_ACCESS_WRITE) ||
        !rvswd_gpio_write_dmi(0x05u, value) ||
        !rvswd_gpio_write_dmi(0x04u, address) ||
        !rvswd_gpio_write_dmi(0x17u, 0x0027100bu) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_gpio_ch5xx_erase_read8(struct rvswd_ch5xx_byte_access *access,
                                         uint32_t address, uint8_t *value) {
    uint32_t abstractcs;
    uint32_t data;

    if (value == NULL ||
        !rvswd_gpio_ch5xx_prepare_byte_access(access, RVSWD_CH5XX_BYTE_ACCESS_READ) ||
        !rvswd_gpio_write_dmi(0x04u, address) ||
        !rvswd_gpio_write_dmi(0x17u, 0x0027100bu) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_gpio_read_dmi(0x05u, &data)) {
        return false;
    }

    *value = (uint8_t)data;
    return true;
}

static bool rvswd_gpio_read_memory32_v30x_once(uint32_t address, uint32_t *value) {
    uint32_t data;

    rvswd_memory_last_error = 0u;
    // V30X 官方 LinkE 使用 Data1 传地址，Access Memory 命令直接返回 Data0
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_DATA1, address)) {
        rvswd_memory_last_error = 0xb1u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_COMMAND, 0x02200000u)) {
        rvswd_memory_last_error = 0xb2u;
        return false;
    }
    if (!rvswd_gpio_read_dmi(RVSWD_DMI_DATA0, &data)) {
        rvswd_memory_last_error = 0xb3u;
        return false;
    }

    *value = data;
    return true;
}

static bool rvswd_gpio_read_memory32_v30x(uint32_t address, uint32_t *value) {
    for (uint8_t retry = 0u; retry < RVSWD_MEMORY_READ_RETRY_COUNT; ++retry) {
        if (rvswd_gpio_read_memory32_v30x_once(address, value)) {
            return true;
        }
    }
    return false;
}

bool rvswd_gpio_read_memory32(uint32_t address, uint32_t *value) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();

    if (value == NULL) {
        return false;
    }
    if (profile == NULL) {
        profile =
            rvswd_target_profile_from_family(rvswd_target_family_hint());
    }
    if (profile != NULL &&
        (profile->wchlink_family == WCHLINK_TARGET_FAMILY_L103 ||
         profile->wchlink_family == WCHLINK_TARGET_FAMILY_CH58X ||
         profile->wchlink_family == WCHLINK_TARGET_FAMILY_CH59X)) {
        return rvswd_gpio_read_memory32_synchronized(address, value);
    }
    if (rvswd_gpio_read_memory32_v30x(address, value)) {
        return true;
    }
    if (profile != NULL || rvswd_target_chip_id() != 0u) {
        return false;
    }

    // 连接阶段尚未取得 ChipID，V30X 失败后兼容 L103 重试
    return rvswd_gpio_read_memory32_synchronized(address, value);
}

bool rvswd_gpio_write_memory32(uint32_t address, uint32_t value) {
    uint32_t abstractcs;

    // 使用 x8 保存数据，x9 保存目标地址
    if (!rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x20u, 0x0084a023u) ||
        !rvswd_gpio_write_dmi(0x21u, 0x00100073u) ||
        !rvswd_gpio_write_dmi(0x04u, address) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00231009u) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_gpio_write_dmi(0x04u, value) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00271008u) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_gpio_write_memory16(uint32_t address, uint16_t value,
                                      uint32_t timeout_us) {
    uint32_t abstractcs;

    // 使用 x8 保存数据，x9 保存目标地址，Program Buffer 执行 sh
    if (!rvswd_gpio_write_dmi(0x18u, 0u) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x20u, 0x00849023u) ||
        !rvswd_gpio_write_dmi(0x21u, 0x00100073u) ||
        !rvswd_gpio_write_dmi(0x04u, address) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00231009u) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_gpio_write_dmi(0x04u, value) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00271008u) ||
        !rvswd_gpio_wait_abstract_idle_timeout(&abstractcs, timeout_us)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_gpio_wait_abstract_idle_timeout(uint32_t *abstractcs,
                                                  uint32_t timeout_us) {
    uint64_t start = bsp_time_us();

    do {
        if (!rvswd_gpio_read_dmi(0x16u, abstractcs)) {
            if (!rvswd_dmi_failure_retryable) {
                return false;
            }
            continue;
        }
        if ((*abstractcs & (1u << 12u)) == 0u) {
            return true;
        }
    } while ((bsp_time_us() - start) < timeout_us);

