0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
    return false;
}

static bool rvswd_gpio_wait_abstract_idle(uint32_t *abstractcs) {
    return rvswd_gpio_wait_abstract_idle_timeout(abstractcs,
                                                 RVSWD_ABSTRACT_TIMEOUT_US);
}

static bool rvswd_gpio_write_memory_streaming(uint32_t address,
                                              const uint8_t *data,
                                              uint32_t length) {
    uint32_t hartinfo;
    uint32_t data0_address;
    uint32_t abstractcs;

    // 通过 Debug Module 的 DATA0/DATA1 地址建立连续写入上下文
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO, 0u) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTCS, 0x00000700u) ||
        !rvswd_gpio_read_dmi(RVSWD_DMI_HARTINFO, &hartinfo)) {
        return false;
    }

    data0_address = RVSWD_DEBUG_DATA_ADDRESS_BASE | (hartinfo & 0x07ffu);

    // x10 指向 DATA0，x11 指向 DATA1，Program Buffer 每次从这两个寄存器取数
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_PROGBUF0, 0x41844100u) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_PROGBUF1, 0x0491c080u) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_PROGBUF2, 0x9002c184u) ||
        !rvswd_gpio_write_raw_gpr(10u, data0_address) ||
        !rvswd_gpio_write_raw_gpr(11u, data0_address + 4u) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_DATA1, address)) {
        return false;
    }

    // 第一字通过显式 COMMAND 启动，避免 V30X 在 COMMAND 前开启 autoexec
    if (!rvswd_gpio_write_dmi(
            RVSWD_DMI_DATA0,
            ((uint32_t)data[0u]) |
                ((uint32_t)data[1u] << 8u) |
                ((uint32_t)data[2u] << 16u) |
                ((uint32_t)data[3u] << 24u)) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_COMMAND,
                               RVSWD_ABSTRACT_COMMAND_EXECUTE) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO,
                               RVSWD_ABSTRACTAUTO_DATA0)) {
        return false;
    }

    // autoexec 让每次 DATA0 写入自动执行一次 Program Buffer，DATA1 由目标端自增
    for (uint32_t offset = 4u; offset < length; offset += 4u) {
        uint32_t value = ((uint32_t)data[offset + 0u]) |
                         ((uint32_t)data[offset + 1u] << 8u) |
                         ((uint32_t)data[offset + 2u] << 16u) |
                         ((uint32_t)data[offset + 3u] << 24u);

        rvswd_memory_failure_address = address + offset;
        if (!rvswd_gpio_write_dmi(RVSWD_DMI_DATA0, value)) {
            (void)rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO, 0u);
            (void)rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTCS, 0x00000700u);
            return false;
        }
    }

    // 关闭自动执行后再读取 ABSTRACTCS，确保最后一个字已经完成
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO, 0u) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u) {
        (void)rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO, 0u);
        (void)rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTCS, 0x00000700u);
        return false;
    }

    return true;
}

static bool rvswd_gpio_write_memory_slow(uint32_t address, const uint8_t *data,
                                         uint32_t length) {
    uint32_t abstractcs;

    // 先配置一次程序缓冲区，后续每个字只更新地址和数据寄存器
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO, 0u) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTCS, 0x00000700u)) {
        rvswd_memory_last_error = 0xe1u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_PROGBUF0, 0x0084a023u)) {
        rvswd_memory_last_error = 0xe2u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_PROGBUF1, 0x00100073u)) {
        rvswd_memory_last_error = 0xe3u;
        return false;
    }

    for (uint32_t offset = 0u; offset < length; offset += 4u) {
        uint32_t value = ((uint32_t)data[offset + 0u]) |
                         ((uint32_t)data[offset + 1u] << 8u) |
                         ((uint32_t)data[offset + 2u] << 16u) |
                         ((uint32_t)data[offset + 3u] << 24u);

        rvswd_memory_failure_address = address + offset;
        if (!rvswd_gpio_write_dmi(0x16u, 0x00000700u)) {
            rvswd_memory_last_error = 0x10u | (rvswd_dmi_last_status & 0x03u);
            return false;
        }
        if (!rvswd_gpio_write_dmi(0x04u, address + offset)) {
            rvswd_memory_last_error = 0x20u | (rvswd_dmi_last_status & 0x03u);
            return false;
        }
        if (!rvswd_gpio_write_dmi(0x17u, 0x00231009u)) {
            rvswd_memory_last_error = 0x30u | (rvswd_dmi_last_status & 0x03u);
            return false;
        }
        if (!rvswd_gpio_write_dmi(0x04u, value)) {
            rvswd_memory_last_error = 0x40u | (rvswd_dmi_last_status & 0x03u);
            return false;
        }
        if (!rvswd_gpio_write_dmi(0x17u, 0x00271008u)) {
            rvswd_memory_last_error = 0x50u | (rvswd_dmi_last_status & 0x03u);
            return false;
        }
        if (!rvswd_gpio_wait_abstract_idle(&abstractcs)) {
            rvswd_memory_last_error = 0x60u | (rvswd_dmi_last_status & 0x03u);
            return false;
        }
        if (((abstractcs >> 8u) & 0x07u) != 0u) {
            rvswd_memory_last_error = 0x70u | (uint8_t)((abstractcs >> 8u) & 0x07u);
            return false;
        }
    }

    if (!rvswd_gpio_read_dmi(0x16u, &abstractcs)) {
        rvswd_memory_last_error = 0xe5u;
        return false;
    }
    if (((abstractcs >> 8u) & 0x07u) != 0u) {
        rvswd_memory_last_error = 0xd0u | (uint8_t)((abstractcs >> 8u) & 0x07u);
        return false;
    }
    return true;
}

bool rvswd_gpio_write_memory(uint32_t address, const uint8_t *data, uint32_t length) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();
    bool success;

    rvswd_memory_last_error = 0u;
    rvswd_memory_failure_dmi_status = 0u;
    rvswd_memory_failure_address = address;
    rvswd_memory_failure_abstractcs = 0xffffffffu;
    if (data == NULL || length == 0u || (address & 3u) != 0u || (length & 3u) != 0u) {
        rvswd_memory_last_error = 0xefu;
        return false;
    }

    if (profile != NULL &&
        profile->memory_write_mode == RVSWD_MEMORY_WRITE_STREAMING) {
        // 目标 profile 支持 autoexec 数据流，先尝试单字 DMI 写入的快速路径
        success = rvswd_gpio_write_memory_streaming(address, data, length);
        if (!success) {
            // 快速路径失败后清理 abstract 状态，再完整重写当前数据块
            (void)rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTAUTO, 0u);
            (void)rvswd_gpio_write_dmi(RVSWD_DMI_ABSTRACTCS, 0x00000700u);
            success = rvswd_gpio_write_memory_slow(address, data, length);
        }
    } else {
        success = rvswd_gpio_write_memory_slow(address, data, length);
    }
    if (!success) {
        rvswd_memory_failure_dmi_status = rvswd_dmi_last_status;
        (void)rvswd_gpio_read_dmi(0x16u, &rvswd_memory_failure_abstractcs);
    }
    return success;
}

uint8_t rvswd_gpio_memory_last_error(void) {
    return rvswd_memory_last_error;
}

uint8_t rvswd_gpio_memory_failure_dmi_status(void) {
    return rvswd_memory_failure_dmi_status;
}

