0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
uint32_t rvswd_gpio_memory_failure_address(void) {
    return rvswd_memory_failure_address;
}

uint32_t rvswd_gpio_memory_failure_abstractcs(void) {
    return rvswd_memory_failure_abstractcs;
}

bool rvswd_gpio_write_register(uint16_t regno, uint32_t value) {
    uint32_t abstractcs;

    if (!rvswd_gpio_write_dmi(0x04u, value) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00230000u | (uint32_t)regno) ||
        !rvswd_gpio_read_dmi(0x16u, &abstractcs)) {
        return false;
    }
    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

bool rvswd_gpio_read_register(uint16_t regno, uint32_t *value) {
    uint32_t abstractcs;

    if (value == NULL ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00220000u | (uint32_t)regno) ||
        !rvswd_gpio_read_dmi(0x16u, &abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u) {
        return false;
    }
    return rvswd_gpio_read_dmi(0x04u, value);
}

static bool rvswd_gpio_write_raw_gpr(uint8_t regno, uint32_t value) {
    uint32_t abstractcs;

    if (!rvswd_gpio_write_dmi(0x04u, value) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00231000u | (uint32_t)regno) ||
        !rvswd_gpio_read_dmi(0x16u, &abstractcs)) {
        return false;
    }
    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_gpio_read_raw_gpr(uint8_t regno, uint32_t *value) {
    uint32_t abstractcs;

    if (value == NULL ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00221000u | (uint32_t)regno) ||
        !rvswd_gpio_read_dmi(0x16u, &abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u) {
        return false;
    }
    return rvswd_gpio_read_dmi(0x04u, value);
}

static bool rvswd_gpio_wait_dmstatus(uint32_t mask, bool set, uint32_t timeout_ms) {
    uint64_t start = bsp_time_us();

    do {
        uint32_t status;

        if (!rvswd_gpio_read_dmi(0x11u, &status)) {
            return false;
        }
        if (((status & mask) != 0u) == set) {
            return true;
        }
        bsp_delay_us(100u);
    } while ((bsp_time_us() - start) < (uint64_t)timeout_ms * 1000u);

    return false;
}

bool rvswd_gpio_halt(void) {
    return rvswd_gpio_write_dmi(0x10u, 0x80000001u) &&
           rvswd_gpio_wait_dmstatus(1u << 9u, true, 100u);
}

bool rvswd_gpio_execute(uint32_t entry, uint32_t stack_top, uint32_t mode,
                        uint32_t address, uint32_t length, uint32_t data_address,
                        uint32_t *result) {
    if (!rvswd_gpio_write_raw_gpr(10u, mode)) {
        if (result != NULL) *result = 0xe001u;
        return false;
    }
    if (!rvswd_gpio_write_raw_gpr(11u, address)) {
        if (result != NULL) *result = 0xe002u;
        return false;
    }
    if (!rvswd_gpio_write_raw_gpr(12u, length)) {
        if (result != NULL) *result = 0xe003u;
        return false;
    }
    if (!rvswd_gpio_write_raw_gpr(13u, data_address)) {
        if (result != NULL) *result = 0xe004u;
        return false;
    }
    if (!rvswd_gpio_write_register(0x1002u, stack_top) ||
        !rvswd_gpio_write_register(0x7b0u, 0x000090c3u) ||
        !rvswd_gpio_write_register(0x300u, 0u) ||
        !rvswd_gpio_write_register(0x7b1u, entry)) {
        if (result != NULL) *result = 0xe005u;
        return false;
    }
    if (!rvswd_gpio_write_dmi(0x10u, 0x80000001u) ||
        !rvswd_gpio_write_dmi(0x10u, 0x80000001u) ||
        !rvswd_gpio_write_dmi(0x10u, 0x00000001u) ||
        !rvswd_gpio_write_dmi(0x10u, 0x40000001u)) {
        if (result != NULL) *result = 0xe006u;
        return false;
    }
    // V30X 的 resumeack 会跨会话保持，给 resumereq 留出处理时间后直接等待 ebreak
    bsp_delay_us(RVSWD_RESUME_MIN_DELAY_US);
    if (!rvswd_gpio_write_dmi(0x10u, 0x00000001u)) {
        if (result != NULL) *result = 0xe006u;
        return false;
    }
    if (!rvswd_gpio_wait_dmstatus(1u << 9u, true, RVSWD_EXECUTE_TIMEOUT_MS)) {
        (void)rvswd_gpio_halt();
        if (result != NULL) *result = 0xe007u;
        return false;
    }
    if (result != NULL) {
        uint32_t value = 0u;

        if (!rvswd_gpio_read_raw_gpr(10u, &value)) {
            *result = 0xe008u;
            return false;
        }
        *result = value;
    }
    return true;
}

static bool rvswd_gpio_flash_wait_ready(uint32_t *status, uint8_t read_error,
                                        uint8_t timeout_error) {
    uint64_t start = bsp_time_us();

    do {
        if (!rvswd_gpio_read_memory32(RVSWD_FLASH_STATR_ADDRESS, status)) {
            rvswd_flash_last_error = read_error;
            return false;
        }
        if ((*status & RVSWD_FLASH_STATR_BUSY) == 0u) {
            return true;
        }
        bsp_delay_us(100u);
    } while ((bsp_time_us() - start) < RVSWD_FLASH_ERASE_TIMEOUT_US);

    rvswd_flash_last_error = timeout_error;
    return false;
}

static bool rvswd_gpio_flash_unlock_main_option_and_fast(uint32_t control) {
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) == 0u) {
        return true;
    }

    // L103 需要同时解锁主存储区、用户字和快速编程模式
    return rvswd_gpio_write_memory32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY1) &&
           rvswd_gpio_write_memory32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY2) &&
           rvswd_gpio_write_memory32(RVSWD_FLASH_OBKEYR_ADDRESS, RVSWD_FLASH_KEY1) &&
           rvswd_gpio_write_memory32(RVSWD_FLASH_OBKEYR_ADDRESS, RVSWD_FLASH_KEY2) &&
           rvswd_gpio_write_memory32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY1) &&
           rvswd_gpio_write_memory32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY2);
}

static bool rvswd_gpio_flash_unlock_main_and_fast(uint32_t control) {
    if ((control & RVSWD_FLASH_CTLR_LOCK) != 0u &&
        (!rvswd_gpio_write_memory32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY1) ||
         !rvswd_gpio_write_memory32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY2))) {
        return false;
    }
    if ((control & RVSWD_FLASH_CTLR_FAST_LOCK) != 0u &&
        (!rvswd_gpio_write_memory32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY1) ||
         !rvswd_gpio_write_memory32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY2))) {
        return false;
    }
    return true;
}

static bool rvswd_gpio_ch5xx_flash_issue(struct rvswd_ch5xx_byte_access *access,
                                         uint8_t command) {
    return rvswd_gpio_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 0u) &&
           rvswd_gpio_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 5u) &&
           rvswd_gpio_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS,
                                          command);
}

