0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
static bool rvswd_gpio_ch5xx_flash_wait_control_ready(
    struct rvswd_ch5xx_byte_access *access) {
    for (uint32_t retry = 0u; retry < RVSWD_CH5XX_FLASH_STATUS_RETRIES; ++retry) {
        uint8_t control;

        if (!rvswd_gpio_ch5xx_erase_read8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS,
                                           &control)) {
            return false;
        }
        if ((control & 0x80u) == 0u) {
            return true;
        }
    }
    return false;
}

static bool rvswd_gpio_ch5xx_flash_end(struct rvswd_ch5xx_byte_access *access) {
    return rvswd_gpio_ch5xx_flash_wait_control_ready(access) &&
           rvswd_gpio_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 0u);
}

static bool rvswd_gpio_ch5xx_flash_out(struct rvswd_ch5xx_byte_access *access,
                                       uint8_t value) {
    return rvswd_gpio_ch5xx_flash_wait_control_ready(access) &&
           rvswd_gpio_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS,
                                          value);
}

static bool rvswd_gpio_ch5xx_flash_in(struct rvswd_ch5xx_byte_access *access,
                                      uint8_t *value) {
    return rvswd_gpio_ch5xx_flash_wait_control_ready(access) &&
           rvswd_gpio_ch5xx_erase_read8(access, RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS,
                                         value);
}

static bool rvswd_gpio_ch5xx_flash_begin(struct rvswd_ch5xx_byte_access *access,
                                         uint8_t command) {
    // CH5xx 每次切换命令前先完成命令 6，命令口状态不能跨命令复用
    return rvswd_gpio_ch5xx_flash_issue(access, 6u) &&
           rvswd_gpio_ch5xx_flash_end(access) &&
           rvswd_gpio_ch5xx_flash_issue(access, command);
}

static bool rvswd_gpio_ch5xx_flash_open(struct rvswd_ch5xx_byte_access *access) {
    // FlashOpen 先使能命令口，再完成 0xff 初始化命令，擦页和写页均从此状态开始
    return rvswd_gpio_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 4u) &&
           rvswd_gpio_ch5xx_flash_begin(access, 0xffu) &&
           rvswd_gpio_ch5xx_flash_end(access);
}

static bool rvswd_gpio_ch5xx_flash_enable_code_mode(void) {
    uint32_t abstractcs;

    // SAFE_ACCESS_SIG 必须在修改 ROM 配置后清零，避免命令口继承未完成的安全访问状态
    if (!rvswd_gpio_write_raw_gpr(13u, RVSWD_CH5XX_FLASH_KEY_ADDRESS) ||
        !rvswd_gpio_write_raw_gpr(10u, 0x57u) ||
        !rvswd_gpio_write_raw_gpr(11u, 0xa8u) ||
        !rvswd_gpio_write_raw_gpr(12u, 0xe0u) ||
        !rvswd_gpio_write_dmi(0x18u, 0u) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x20u, 0x00a68023u) ||
        !rvswd_gpio_write_dmi(0x21u, 0x00b68023u) ||
        !rvswd_gpio_write_dmi(0x22u, 0x00010001u) ||
        !rvswd_gpio_write_dmi(0x23u, 0x00c68223u) ||
        !rvswd_gpio_write_dmi(0x24u, 0x00068023u) ||
        !rvswd_gpio_write_dmi(0x25u, 0x00100073u) ||
        !rvswd_gpio_write_dmi(0x17u, 0x00271000u) ||
        !rvswd_gpio_wait_abstract_idle(&abstractcs)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_gpio_ch5xx_flash_write_address(struct rvswd_ch5xx_byte_access *access,
                                                 uint32_t address) {
    return rvswd_gpio_ch5xx_flash_out(access, (uint8_t)(address >> 16u)) &&
           rvswd_gpio_ch5xx_flash_out(access, (uint8_t)(address >> 8u)) &&
           rvswd_gpio_ch5xx_flash_out(access, (uint8_t)address);
}

static bool rvswd_gpio_ch5xx_flash_wait_ready(struct rvswd_ch5xx_byte_access *access) {
    if (!rvswd_gpio_ch5xx_flash_end(access)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_COMMAND_FINISH;
        return false;
    }

    for (uint32_t retry = 0u; retry < RVSWD_CH5XX_FLASH_STATUS_RETRIES; ++retry) {
        uint8_t status;

        // LinkE 连续读取两次状态，第二次读数用于判断命令是否仍在执行
        if (!rvswd_gpio_ch5xx_flash_begin(access, 5u)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_STATUS_BEGIN;
            return false;
        }
        if (!rvswd_gpio_ch5xx_flash_in(access, &status)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_STATUS_READ_FIRST;
            return false;
        }
        if (!rvswd_gpio_ch5xx_flash_in(access, &status)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_STATUS_READ_SECOND;
            return false;
        }
        if (!rvswd_gpio_ch5xx_flash_end(access)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_STATUS_FINISH;
            return false;
        }
        if ((status & 1u) == 0u) {
            return true;
        }
    }
    rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_STATUS_TIMEOUT;
    return false;
}

static bool rvswd_gpio_ch5xx_flash_erase_command(
    struct rvswd_ch5xx_byte_access *access, uint32_t address, uint8_t command) {
    if (!rvswd_gpio_ch5xx_flash_begin(access, command)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_COMMAND_BEGIN;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_write_address(access, address)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_COMMAND_ADDRESS;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_wait_ready(access)) {
        return false;
    }
    return true;
}

static bool rvswd_gpio_ch5xx_flash_program_page(
    struct rvswd_ch5xx_byte_access *access, const uint8_t *data) {
    uint32_t abstractcs;

    // 官方 0x33D4 与 CH5xx 参考实现都使用该 Program Buffer，将 a4 的字写入 Flash 数据口
    access->mode = RVSWD_CH5XX_BYTE_ACCESS_NONE;
    if (!rvswd_gpio_write_raw_gpr(13u, RVSWD_CH5XX_FLASH_WORD_DATA_ADDRESS) ||
        !rvswd_gpio_write_raw_gpr(5u, 21u) ||
        !rvswd_gpio_write_dmi(0x18u, 0u) ||
        !rvswd_gpio_write_dmi(0x16u, 0x00000700u) ||
        !rvswd_gpio_write_dmi(0x20u, 0x4791c298u) ||
        !rvswd_gpio_write_dmi(0x21u, 0x00668703u) ||
        !rvswd_gpio_write_dmi(0x22u, 0xfe074ee3u) ||
        !rvswd_gpio_write_dmi(0x23u, 0x00568323u) ||
        !rvswd_gpio_write_dmi(0x24u, 0xfbed17fdu) ||
        !rvswd_gpio_write_dmi(0x25u, 0x00100073u)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_SETUP;
        return false;
    }

    for (uint32_t offset = 0u; offset < RVSWD_CH5XX_FLASH_PAGE_SIZE; offset += 4u) {
        uint32_t value = (uint32_t)data[offset + 0u] |
                         ((uint32_t)data[offset + 1u] << 8u) |
                         ((uint32_t)data[offset + 2u] << 16u) |
                         ((uint32_t)data[offset + 3u] << 24u);

        if (!rvswd_gpio_write_dmi(0x04u, value)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_DATA;
            return false;
        }
        // 该 Abstract Command 同时把 data0 传入 a4 并执行 Program Buffer
        if (!rvswd_gpio_write_dmi(0x17u, 0x0027100eu)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_EXECUTE;
            return false;
        }
        // 目标执行真实 Flash 写入时 busy 可长于普通内存访问，单字仍受 100 ms 上限约束
        if (!rvswd_gpio_wait_abstract_idle_timeout(
                &abstractcs, RVSWD_CH5XX_PAGE_PROGRAM_TIMEOUT_US)) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_WAIT;
            return false;
        }
        if (((abstractcs >> 8u) & 0x07u) != 0u) {
            rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_STATUS;
            return false;
        }
    }
    return true;
}

bool rvswd_gpio_flash_rewrite_page(uint32_t address, const uint8_t *data) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();
    struct rvswd_ch5xx_byte_access access = {
        .mode = RVSWD_CH5XX_BYTE_ACCESS_NONE,
    };

    rvswd_flash_last_error = 0u;
    if (profile == NULL || !profile->ch5xx_protocol || data == NULL) {
        rvswd_flash_last_error = 0x0fu;
        return false;
    }
    if ((address & 0xffu) != 0u) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_UNALIGNED;
        return false;
    }

