0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
    // 官方 0x0A 路径先用命令 0x81 擦页，再独立建立命令 0x02 的整页写入状态
    if (!rvswd_gpio_ch5xx_flash_enable_code_mode()) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_ERASE_CODE_MODE;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_open(&access)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_ERASE_OPEN;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_erase_command(&access, address, 0x81u)) {
        return false;
    }
    // 擦页会结束前一条 Flash 命令，写页前重新写入 SAFE_ACCESS_SIG 和 code mode
    if (!rvswd_gpio_ch5xx_flash_enable_code_mode()) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_CODE_MODE;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_open(&access)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_OPEN;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_begin(&access, 0x02u) ||
        !rvswd_gpio_ch5xx_flash_write_address(&access, address)) {
        rvswd_flash_last_error = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_BEGIN;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_program_page(&access, data)) {
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_wait_ready(&access)) {
        return false;
    }
    return true;
}

static bool rvswd_gpio_ch5xx_flash_erase_all(void) {
    size_t stub_length =
        (size_t)(ch5xx_flash_erase_stub_end - ch5xx_flash_erase_stub_start);
    uint32_t result;

    // RAM stub 按 LinkE 固件的 4 KiB 扇区路径完成整片擦除
    if (stub_length == 0u || stub_length > RVSWD_CH5XX_ERASE_STUB_MAX_SIZE ||
        (stub_length & 3u) != 0u) {
        rvswd_flash_last_error = 0xc1u;
        return false;
    }
    if (!rvswd_gpio_write_memory(RVSWD_CH5XX_ERASE_STUB_ADDRESS,
                                 ch5xx_flash_erase_stub_start,
                                 (uint32_t)stub_length)) {
        rvswd_flash_last_error = 0xc2u;
        return false;
    }
    if (!rvswd_gpio_ch5xx_flash_enable_code_mode()) {
        rvswd_flash_last_error = 0xc3u;
        return false;
    }
    if (!rvswd_gpio_execute(RVSWD_CH5XX_ERASE_STUB_ADDRESS,
                            RVSWD_CH5XX_ERASE_STUB_STACK_TOP, 0u, 0u,
                            RVSWD_CH5XX_FLASH_END, 0u, &result)) {
        rvswd_flash_last_error = 0xc4u;
        return false;
    }
    if (result != 0u) {
        rvswd_flash_last_error = 0xc5u;
        return false;
    }
    return true;
}

bool rvswd_gpio_flash_erase_all(void) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();
    uint32_t control;
    uint32_t idle_control;
    uint32_t status;
    bool unlocked;
    bool success = false;

    rvswd_flash_last_error = 0u;
    if (profile == NULL) {
        rvswd_flash_last_error = 0x0fu;
        return false;
    }
    if (profile->ch5xx_protocol) {
        return rvswd_gpio_ch5xx_flash_erase_all();
    }

    if (!rvswd_gpio_flash_wait_ready(&status, 0x11u, 0x12u)) {
        return false;
    }

    if (!rvswd_gpio_read_memory32(RVSWD_FLASH_CTLR_ADDRESS, &control)) {
        rvswd_flash_last_error = 0x13u;
        return false;
    }

    switch (profile->erase_unlock) {
        case RVSWD_FLASH_UNLOCK_MAIN_OPTION_AND_FAST:
            unlocked = rvswd_gpio_flash_unlock_main_option_and_fast(control);
            break;
        case RVSWD_FLASH_UNLOCK_MAIN_AND_FAST:
            unlocked = rvswd_gpio_flash_unlock_main_and_fast(control);
            break;
        default:
            rvswd_flash_last_error = 0x0fu;
            return false;
    }
    if (!unlocked) {
        rvswd_flash_last_error = 0x14u;
        return false;
    }

    if (!rvswd_gpio_read_memory32(RVSWD_FLASH_CTLR_ADDRESS, &control)) {
        rvswd_flash_last_error = 0x15u;
        return false;
    }
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) != 0u) {
        rvswd_flash_last_error = 0x16u;
        return false;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_MER | RVSWD_FLASH_CTLR_STRT);

    // 清除上一次操作遗留的完成和写保护状态，避免误判本次擦除
    if ((status & (RVSWD_FLASH_STATR_EOP | RVSWD_FLASH_STATR_WRPRTERR)) != 0u &&
        !rvswd_gpio_write_memory32(
            RVSWD_FLASH_STATR_ADDRESS,
            status & (RVSWD_FLASH_STATR_EOP | RVSWD_FLASH_STATR_WRPRTERR))) {
        rvswd_flash_last_error = 0x17u;
        goto cleanup;
    }

    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_CTLR_ADDRESS, idle_control)) {
        rvswd_flash_last_error = 0x18u;
        goto cleanup;
    }
    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_CTLR_ADDRESS,
                                   idle_control | RVSWD_FLASH_CTLR_MER)) {
        rvswd_flash_last_error = 0x19u;
        goto cleanup;
    }
    if (!rvswd_gpio_write_memory32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_MER | RVSWD_FLASH_CTLR_STRT)) {
        rvswd_flash_last_error = 0x1au;
        goto cleanup;
    }
    if (!rvswd_gpio_flash_wait_ready(&status, 0x1bu, 0x1cu)) {
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error = 0x1du;
        goto cleanup;
    }
    success = true;

cleanup:
    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_CTLR_ADDRESS, idle_control)) {
        if (rvswd_flash_last_error == 0u) {
            rvswd_flash_last_error = 0x1eu;
        }
        success = false;
    }
    return success;
}

bool rvswd_gpio_flash_read_protected(bool *protected) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();
    uint32_t option_status;

    rvswd_flash_last_error = 0u;
    if (protected == NULL) {
        rvswd_flash_last_error = 0x21u;
        return false;
    }
    if (profile == NULL || profile->ch5xx_protocol) {
        rvswd_flash_last_error = 0x22u;
        return false;
    }
    if (!rvswd_gpio_read_memory32(RVSWD_FLASH_OBR_ADDRESS, &option_status)) {
        rvswd_flash_last_error = 0x23u;
        return false;
    }

    *protected = (option_status & RVSWD_FLASH_OBR_READ_PROTECTED) != 0u;
    return true;
}

bool rvswd_gpio_flash_write_protected(bool *protected) {
    const struct rvswd_target_profile *profile = rvswd_target_profile_current();
    uint32_t write_protection;

    rvswd_flash_last_error = 0u;
    if (protected == NULL) {
        rvswd_flash_last_error = 0x24u;
        return false;
    }
    if (profile == NULL || profile->ch5xx_protocol) {
        rvswd_flash_last_error = 0x25u;
        return false;
    }
    if (!rvswd_gpio_read_memory32(RVSWD_FLASH_WPR_ADDRESS, &write_protection)) {
        rvswd_flash_last_error = 0x26u;
        return false;
    }

    *protected = write_protection != 0xffffffffu;
    return true;
}

static bool rvswd_gpio_flash_unlock_option_bytes(bool unlock_fast_mode) {
    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY1)) {
        rvswd_flash_last_error = 0xa1u;
        return false;
    }
    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY2)) {
        rvswd_flash_last_error = 0xa2u;
        return false;
    }
    if (unlock_fast_mode) {
        if (!rvswd_gpio_write_memory32(RVSWD_FLASH_MODEKEYR_ADDRESS,
                                       RVSWD_FLASH_KEY1)) {
            rvswd_flash_last_error = 0xa3u;
            return false;
        }
        if (!rvswd_gpio_write_memory32(RVSWD_FLASH_MODEKEYR_ADDRESS,
                                       RVSWD_FLASH_KEY2)) {
            rvswd_flash_last_error = 0xa4u;
            return false;
        }
    }
    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_OBKEYR_ADDRESS,
                                   RVSWD_FLASH_KEY1)) {
        rvswd_flash_last_error = 0xa5u;
        return false;
    }
    if (!rvswd_gpio_write_memory32(RVSWD_FLASH_OBKEYR_ADDRESS,
                                   RVSWD_FLASH_KEY2)) {
        rvswd_flash_last_error = 0xa6u;
        return false;
    }
    return true;
}

