0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd_gpio.c
        option_words[0] = (option_words[0] & 0xffff0000u) |
                          (protected ? RVSWD_OPTION_RDP_PROTECTED
                                     : RVSWD_OPTION_RDP_UNPROTECTED);
        switch (profile->option_write) {
            case RVSWD_OPTION_WRITE_FAST_BUFFER:
                if (!rvswd_gpio_flash_write_option_bytes_fast_buffer(profile,
                                                                     option_words)) {
                    return false;
                }
                break;
            case RVSWD_OPTION_WRITE_HALFWORD:
                if (!rvswd_gpio_flash_write_option_bytes_halfword(profile,
                                                                  option_words)) {
                    return false;
                }
                break;
            default:
                rvswd_flash_last_error = 0x5fu;
                return false;
        }
    }

    // 解除读保护时目标硬件会自动整片擦除主存储区，复位后 OBR 才加载新状态
    if (!rvswd_gpio_reset_and_halt()) {
        rvswd_flash_last_error = 0x46u;
        return false;
    }
    if (!rvswd_gpio_flash_read_protected(&current)) {
        return false;
    }
    if (current != protected) {
        rvswd_flash_last_error = 0x47u;
        return false;
    }
    return true;
}

uint32_t rvswd_gpio_flash_last_error(void) {
    return rvswd_flash_last_error;
}

bool rvswd_gpio_reset_and_halt(void) {
    // ndmreset 保持 Debug Module 工作，释放后重新停住目标核
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x80000003u)) {
        return false;
    }
    bsp_delay_us(1000u);
    return rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x80000001u) &&
           rvswd_gpio_wait_dmstatus(1u << 9u, true, 100u);
}

bool rvswd_gpio_soft_reset_and_run(void) {
    // 软复位后显式发送 resumereq，确保目标从复位向量继续运行
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x00000003u) ||
        !rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x00000001u)) {
        return false;
    }
    bsp_delay_us(RVSWD_RESUME_MIN_DELAY_US);
    return rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x40000001u);
}

bool rvswd_gpio_reset_and_run(void) {
    // 不设置 haltreq，释放 ndmreset 后让目标从复位向量继续运行
    if (!rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x00000003u)) {
        return false;
    }
    bsp_delay_us(1000u);
    return rvswd_gpio_write_dmi(RVSWD_DMI_CONTROL, 0x00000001u);
}

bool rvswd_gpio_read_dmi(uint8_t address, uint32_t *value) {
    if (value == NULL) {
        return false;
    }
    if (rvswd_packet_mode == RVSWD_PACKET_LONG) {
        uint8_t status;
        uint32_t data;

        rvswd_dmi_failure_retryable = false;
        for (uint8_t retry = 0u; retry < RVSWD_DMI_READ_RETRY_COUNT; ++retry) {
            if (!rvswd_transaction_long(1u, address, 0u, 0u, NULL, &data, &status)) {
                rvswd_dmi_failure_retryable = true;
                bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
                continue;
            }

            rvswd_dmi_last_status = status;
            if (status == RVSWD_LONG_STATUS_OK) {
                *value = data;
                return true;
            }
            if (status == RVSWD_LONG_STATUS_BUSY) {
                rvswd_dmi_failure_retryable = true;
                bsp_delay_us(RVSWD_DMI_BUSY_DELAY_US);
            } else {
                rvswd_dmi_failure_retryable = false;
                bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
            }
        }
        return false;
    }

    uint8_t frame[7] = {0};
    uint8_t target[7] = {0};
    uint8_t status;

    rvswd_frame_pack_read(frame, address);
    rvswd_dmi_failure_retryable = false;
    for (uint8_t retry = 0u; retry < RVSWD_DMI_READ_RETRY_COUNT; ++retry) {
        if (!rvswd_transaction(frame, target, true)) {
            return false;
        }

        status = rvswd_frame_unpack_handshake(target);
        rvswd_dmi_last_status = status;
        if (status == RVSWD_STATUS_BUSY) {
            rvswd_dmi_failure_retryable = true;
            bsp_delay_us(RVSWD_DMI_BUSY_DELAY_US);
            continue;
        }
        if (!rvswd_frame_status_is_ok(status)) {
            rvswd_dmi_failure_retryable = false;
            bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
            continue;
        }
        *value = rvswd_frame_unpack_data(target);
        if (rvswd_frame_get_bit(target, 46u) != rvswd_frame_xor_bits(*value)) {
            rvswd_dmi_failure_retryable = true;
            bsp_delay_us(RVSWD_DMI_ERROR_DELAY_US);
            continue;
        }
        return true;
    }

    return false;
}

bool rvswd_gpio_dmi_failure_retryable(void) {
    return rvswd_dmi_failure_retryable;
}

static bool rvswd_gpio_identify_target(void) {
    const struct rvswd_target_profile *expected_profile =
        rvswd_target_profile_from_family(rvswd_target_family_hint());
    const struct rvswd_target_profile *direct_profile;
    uint32_t direct_chip_id;
    uint32_t option_status;
    uint8_t ch5xx_chip_id;

    // V30X 的官方 LinkE 直接从 DMI 0x7f 返回 ChipID，避免先执行抽象内存命令
    if (rvswd_gpio_read_dmi(RVSWD_DMI_CHIP_ID, &direct_chip_id) &&
        direct_chip_id != 0u) {
        direct_profile = rvswd_target_profile_from_chip_id(direct_chip_id);
        if (direct_profile != NULL && !direct_profile->ch5xx_protocol) {
            rvswd_target_set_chip_id(direct_chip_id);
            rvswd_fast_timing = direct_profile->fast_timing;
            return true;
        }
    }

    if (rvswd_gpio_read_memory8_ch5xx(RVSWD_CH5XX_CHIP_ID_ADDRESS,
                                      &ch5xx_chip_id) &&
        (ch5xx_chip_id == RVSWD_CH5XX_CHIP_ID_CH582 ||
         ch5xx_chip_id == RVSWD_CH5XX_CHIP_ID_CH583 ||
         ch5xx_chip_id == RVSWD_CH5XX_CHIP_ID_CH591 ||
         ch5xx_chip_id == RVSWD_CH5XX_CHIP_ID_CH592)) {
        // CH5xx 通过专用 8 位寄存器报告型号，协议层使用 family 高字节形式
        rvswd_target_set_chip_id((uint32_t)ch5xx_chip_id << 24u);
        // 连接阶段只确认目标身份，Flash 命令口在实际擦除流程中单独解锁
        return true;
    }
    uint32_t memory_chip_id = 0u;
    if (rvswd_gpio_read_memory32(0x1ffff704u, &memory_chip_id) &&
        memory_chip_id != 0u) {
        rvswd_target_set_chip_id(memory_chip_id);
        direct_profile = rvswd_target_profile_from_chip_id(memory_chip_id);
        rvswd_fast_timing = direct_profile != NULL && direct_profile->fast_timing;
        return true;
    }
    if (expected_profile != NULL &&
        rvswd_gpio_read_memory32(RVSWD_FLASH_OBR_ADDRESS, &option_status) &&
        (option_status & RVSWD_FLASH_OBR_READ_PROTECTED) != 0u) {
        // ChipID 读取失败时，受限会话使用主机 SetSpeed 提示的 profile
        rvswd_target_set_family_hint_active(true);
        return true;
    }
    return false;
}

static bool rvswd_try_connect(void) {
    rvswd_connect_last_error = 0u;
    rvswd_target_reset();
    if (rvswd_packet_mode == RVSWD_PACKET_LONG) {
        // CH58x 的 V4A 调试模块连接前需要先清空两线接口的唤醒状态
        rvswd_wakeup(true);
        rvswd_wakeup(false);
    }
    for (uint8_t attempt = 0u; attempt < 3u; ++attempt) {
        uint32_t config = 0u;
        uint32_t dmstatus = 0u;
        bool config_read;

        // 目标上电或复位后需要留出调试模块启动时间
        bsp_delay_ms(16u);

        // 通过当前目标族的 DMI 帧解锁调试模块并读回配置签名
        // 初始化阶段按 DTM 管线推进请求，单次 BUSY 不重复占用同一请求
        if (!rvswd_gpio_restore_debug_module()) {
            rvswd_connect_last_error = 0x12u;
            continue;
        }
        // 只有目标核进入 Debug Mode 后，Program Buffer 和 abstract command 才可执行
        if (!rvswd_gpio_halt()) {
            rvswd_connect_last_error = 0x14u;
            continue;
        }
        config_read = rvswd_gpio_read_dmi(RVSWD_DMI_CONFIG, &config);
        if (config_read && (config & 0xffff0000u) == 0x5aa50000u) {
            if (rvswd_gpio_identify_target()) {
                return true;
            }
            rvswd_connect_last_error = 0x13u;
        }

        // 失败诊断继续读取 DMSTATUS，区分严格签名不匹配和链路不可用
        if (rvswd_gpio_read_dmi(0x11u, &dmstatus)) {
            uint8_t version = (uint8_t)(dmstatus & 0x0fu);

            // 当前支持的 QingKe V4 目标仅接受 Debug 0.13.2
            if (version == 2u) {
                if (rvswd_gpio_identify_target()) {
                    return true;
                }
                rvswd_connect_last_error = 0x13u;
                continue;
            }
            rvswd_connect_last_error = 0x20u | version;
        } else {
            rvswd_connect_last_error = config_read ? 0x11u : 0x12u;
        }
    }
    if (rvswd_packet_mode == RVSWD_PACKET_SHORT) {
        // OpenOCD 可能未预先提供 CH58x family，补一次 long frame 探测
        rvswd_packet_mode = RVSWD_PACKET_LONG;
        return rvswd_try_connect();
    }
    return false;
}

static bool rvswd_try_connect_short_autodetect(void) {
    rvswd_connect_last_error = 0u;
    rvswd_target_reset();

